Revit 2027 API
ParameterTypeId.StairstypeMinimumTreadWidthInsideBoundary Property
 "Min. Tread Depth on Winder Inner Boundary": Minimum Tread Width on Inside Boundary
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeMinimumTreadWidthInsideBoundary { get; }
Public Shared ReadOnly Property StairstypeMinimumTreadWidthInsideBoundary As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeMinimumTreadWidthInsideBoundary {
	ForgeTypeId^ get ();
}
static member StairstypeMinimumTreadWidthInsideBoundary : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace